const translationRu = {
  employee: "Сотрудник",
  success : "Вы успешно зарегистрировались!",
  fail : "Неверный логин или пароль",
  noemployees : "Нет сотрудников",
  sidebar: {
    home: "главный",
    employees: "сотрудники",
    acceptance: "принятие",
  },
  home: {
    title: "главный",
    teachers: "учителя",
    employees: "сотрудники",
    all_employees:"все сотрудники"
  },
  employees: {
    title: "Сотрудники",
    search: "поиск",
    add: "Добавить сотрудника",
    edit: "редактирование",
    delete: "удалить",
    confirmation: "подтверждение",
    modalText: "действительно ",
    modalText2: "вы хотите удалить сотрудника",
    yes: "Да",
    no: "нет",
  },
  acceptance: {
    desc: "описание",
    input: "Введите здесь свое описание",
  },
  form: {
    full_name: "Полное имя",
    desc: "Описание",
    education: "Образование",
    scientific_degree: "Ученая степень",
    role: "Роль",
    teacher: "Учитель",
    worker: "Руководство",
    is_teacher: "Учитель",
    phone: "Телефон",
    email: "Электронная почта",
    admission_days: "Дни приема",
    photo: "Фото",
    position:"позиция",
    number: "номер сотрудника",
    validation: {
      name: "Пожалуйста, введите Ваше полное имя!",
      desc: "Пожалуйста, введите описание",
      education: "Укажите, пожалуйста, свое образование!",
      degree: "Пожалуйста, укажите вашу научную степень!",
      role: "Пожалуйста, выберите свою роль!",
      phone: "Пожалуйста, введите ваш номер телефона!",
      email: "Пожалуйста, введите свой адрес электронной почты!",
      email2: "Введенный адрес электронной почты недействителен !",
      days: "Пожалуйста, введите дни приема!",
      photo: "Пожалуйста, выберите фотографию!",
      edge: "ограничение количества: "
    },
  },
  toast: {
    post_err: "Произошла ошибка",
    post_success: "Добавлено успешно",
    delete_success: "Работник успешно удален",
    edit_success:"Изменено успешно",
    textAria_success: "информация успешно добавлена"
  },
};

export default translationRu;
